#pragma once

// Everspace2_Prototype SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ES2_ES2_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class ES2.ActivityBase
// 0x00E8 (0x0418 - 0x0330)
class AActivityBase : public AActor
{
public:
	struct FName                                       ActivityID;                                               // 0x0330(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	struct FName                                       LocationID;                                               // 0x0338(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EActivityState                                     State;                                                    // 0x0340(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EActivityType                                      ActivityType;                                             // 0x0341(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0342(0x0006) MISSED OFFSET
	TMap<struct FName, struct FESVariant>              Attributes;                                               // 0x0348(0x0050) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FScriptMulticastDelegate                    OnActivityActivated;                                      // 0x0398(0x0010) (ZeroConstructor, InstancedReference)
	struct FScriptMulticastDelegate                    OnActivitySucceeded;                                      // 0x03A8(0x0010) (ZeroConstructor, InstancedReference)
	struct FScriptMulticastDelegate                    OnActivityFailed;                                         // 0x03B8(0x0010) (ZeroConstructor, InstancedReference)
	struct FScriptMulticastDelegate                    OnActivityEnded;                                          // 0x03C8(0x0010) (ZeroConstructor, InstancedReference)
	struct FScriptMulticastDelegate                    OnTimeExpired;                                            // 0x03D8(0x0010) (ZeroConstructor, InstancedReference)
	float                                              DistanceToPlayerThreshold;                                // 0x03E8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0xC];                                       // 0x03EC(0x000C) MISSED OFFSET
	struct FVector                                     LastActivityPOILocation;                                  // 0x03F8(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0404(0x0004) MISSED OFFSET
	class USelfRegisteringComponent*                   SelfRegistering;                                          // 0x0408(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0410(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.ActivityBase");
		return ptr;
	}


	void TriggerOrBindEventActivitySucceeded(struct FScriptDelegate* Event);
	void TriggerOrBindEventActivityFailed(struct FScriptDelegate* Event);
	void TriggerOrBindEventActivityEnded(struct FScriptDelegate* Event);
	void TriggerOrBindEventActivityActivated(struct FScriptDelegate* Event);
	void SwitchState(EActivityState* NewState);
	void SetLocation(struct FName* NewLocationID);
	void SetAttribute(struct FName* AttributeName, struct FESVariant* AttributeValue);
	void RestoringState();
	void ResetActivities(bool* bIncludingThis);
	void OnResetActivity();
	void OnPlayerLeftActivityLocation(TEnumAsByte<EJumpMethod>* JumpMethod);
	void OnDeactivate();
	void OnAbandonedByPlayer();
	bool IsPlayerAtActivityLocation();
	bool HasEnded();
	struct FESVariant FindOrCreateAttribute(struct FName* Key, struct FESVariant* InitValue, bool* bWasNewlyCreated);
	bool FindAttribute(struct FName* AttributeName, struct FESVariant* AttributeValue_OUT);
	bool STATIC_FindActivityInPlayerData(struct FName* InActivityID, struct FActivitySaveGameData* SavedData);
	bool CheckIfPlayerIsNearby();
	void ActivateActivity();
	void Abort();
};


// Class ES2.ActivityComponent
// 0x0000 (0x00F8 - 0x00F8)
class UActivityComponent : public UActorComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.ActivityComponent");
		return ptr;
	}

};


// Class ES2.ActorPool
// 0x0088 (0x00B0 - 0x0028)
class UActorPool : public UObject
{
public:
	TArray<class AActor*>                              AvailableActors;                                          // 0x0028(0x0010) (ZeroConstructor, Transient)
	TArray<class AActor*>                              UsedActors;                                               // 0x0038(0x0010) (ZeroConstructor, Transient)
	class AActor*                                      MyOwner;                                                  // 0x0048(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class APawn*                                       MyInstigator;                                             // 0x0050(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UClass*                                      ActorClass;                                               // 0x0058(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x50];                                      // 0x0060(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.ActorPool");
		return ptr;
	}

};


// Class ES2.ActorPostEditEvent
// 0x0000 (0x0330 - 0x0330)
class AActorPostEditEvent : public AActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.ActorPostEditEvent");
		return ptr;
	}


	void PostEdit();
};


// Class ES2.AiControllerBase
// 0x0038 (0x0470 - 0x0438)
class AAiControllerBase : public AAIController
{
public:
	class UMovementPredictionComponent*                ShipMovementPrediction;                                   // 0x0438(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData)
	struct FVector                                     HomeLocation;                                             // 0x0440(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x044C(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    AIEventDispatcher;                                        // 0x0450(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               IsExecutingCriticalSequence;                              // 0x0460(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0461(0x0007) MISSED OFFSET
	class UBlackboardData*                             BlackboardData;                                           // 0x0468(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.AiControllerBase");
		return ptr;
	}


	void TargetTurnedHostileCallback(TEnumAsByte<EFactions>* HostileFaction);
	void SetHomeLocation(struct FVector* Location);
	void RestartBehaviorTree();
	void ChangedFactionCallback(TEnumAsByte<EFactions>* NewFaction);
};


// Class ES2.AreaGate
// 0x0008 (0x0338 - 0x0330)
class AAreaGate : public AActor
{
public:
	class USelfRegisteringComponent*                   SelfRegistering;                                          // 0x0330(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.AreaGate");
		return ptr;
	}


	void ReceivePawnLeaving(class AESPawn** Pawn);
	void ReceivePawnEntering(class AESPawn** Pawn);
};


// Class ES2.HitpointComponent
// 0x0098 (0x0190 - 0x00F8)
class UHitpointComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x00F8(0x0010) MISSED OFFSET
	float                                              HitpointRatio;                                            // 0x0108(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsInvulnerable;                                          // 0x010C(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x010D(0x0003) MISSED OFFSET
	struct FAttributeAccess                            MaxHitpoints;                                             // 0x0110(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      UnknownData02[0x20];                                      // 0x0160(0x0020) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnHitpointsChanged;                                       // 0x0180(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.HitpointComponent");
		return ptr;
	}


	void SetMaxHitpoints(float* MaxHP);
	void SetInvulnerable(bool* bNewInvulnerable);
	void SetCurrentHitpointsWithRatio(float* Ratio);
	void SetCurrentHitpoints(float* Hitpoints);
	bool IsDepleted();
	bool IsDamaged();
	float GetRecentDamageRatio();
	float GetRatio();
	float GetMaxHitpoints();
	float GetCurrentHitpoints();
	void ChangeHitpoints(float* HitpointsDelta, float* OUT_DamageAbsorbed, float* OUT_DamageOverkill);
};


// Class ES2.ArmorComponent
// 0x0028 (0x01B8 - 0x0190)
class UArmorComponent : public UHitpointComponent
{
public:
	struct FScriptMulticastDelegate                    OnArmorChanged;                                           // 0x0190(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnArmorDepleted;                                          // 0x01A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              DamageLimit;                                              // 0x01B0(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x01B4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.ArmorComponent");
		return ptr;
	}


	void TakeDamage(float* DamageAmount, bool* bIsCritical, class AController** EventInstigator, class AActor** DamageCauser, struct FDamageEvent* DamageEvent, struct FHitResult* HitResult, float* DamageAbsorbed, float* DamageRemaining);
};


// Class ES2.AttributeIDs
// 0x0508 (0x0530 - 0x0028)
class UAttributeIDs : public UObject
{
public:
	struct FName                                       ID_ENERGY_CORE_CAPACITY;                                  // 0x0028(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ENERGY_CORE_CAPACITY_BUFF;                             // 0x0030(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ENERGY_CORE_REGEN;                                     // 0x0038(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ENERGY_CORE_REGEN_BUFF;                                // 0x0040(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ENERGY_CORE_STAND_BONUS;                               // 0x0048(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ENERGY_CORE_STAND_BONUS_BUFF;                          // 0x0050(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ENERGY_CORE_REGEN_DELAY;                               // 0x0058(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ENERGY_CORE_REGEN_DELAY_BUFF;                          // 0x0060(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SHIELD_CAPACITY;                                       // 0x0068(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SHIELD_CAPACITY_BUFF;                                  // 0x0070(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SHIELD_RECHARGE;                                       // 0x0078(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SHIELD_RECHARGE_BUFF;                                  // 0x0080(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SHIELD_RECHARGE_DELAY;                                 // 0x0088(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SHIELD_RECHARGE_DELAY_BUFF;                            // 0x0090(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SHIELD_SHUTDOWN_DURATION;                              // 0x0098(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SHIELD_SHUTDOWN_DURATION_BUFF;                         // 0x00A0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_HULL_HITPOINTS;                                        // 0x00A8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_HULL_HITPOINTS_BUFF;                                   // 0x00B0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ARMOR;                                                 // 0x00B8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ARMOR_BUFF;                                            // 0x00C0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_STRUCTURE;                                             // 0x00C8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_RESISTANCE;                                            // 0x00D0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_REPAIR;                                                // 0x00D8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_PRECISION;                                             // 0x00E0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_UTILITY;                                               // 0x00E8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_FIREPOWER;                                             // 0x00F0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_CRUISE_SPEED;                                          // 0x00F8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_CRUISE_SPEED_BUFF;                                     // 0x0100(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_BOOST_SPEED;                                           // 0x0108(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_BOOST_SPEED_BUFF;                                      // 0x0110(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_BOOST_ACCELERATION;                                    // 0x0118(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_BOOST_ACCELERATION_BUFF;                               // 0x0120(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_BOOST_DURATION;                                        // 0x0128(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_BOOST_DURATION_BUFF;                                   // 0x0130(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_BOOST_RECHARGE_DURATION;                               // 0x0138(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_BOOST_RECHARGE_DURATION_BUFF;                          // 0x0140(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_BOOST_RECHARGE_DELAY;                                  // 0x0148(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_BOOST_REGEN_DELAY_BUFF;                                // 0x0150(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_HANDLING;                                              // 0x0158(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_HANDLING_BUFF;                                         // 0x0160(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_SLOTS;                                          // 0x0168(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_LAUNCHER_SLOTS;                                        // 0x0170(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DEVICE_SLOTS;                                          // 0x0178(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_CONSUMABLE_SLOTS;                                      // 0x0180(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_CARGO_SLOTS;                                           // 0x0188(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_CARGO_SLOTS_BUFF;                                      // 0x0190(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_HULL_DAMAGE;                                    // 0x0198(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_HULL_DAMAGE_BUFF;                               // 0x01A0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_SHIELD_DAMAGE;                                  // 0x01A8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_SHIELD_DAMAGE_BUFF;                             // 0x01B0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_RANGE;                                          // 0x01B8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_RANGE_BUFF;                                     // 0x01C0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_DAMAGE_RADIUS;                                  // 0x01C8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_DAMAGE_RADIUS_BUFF;                             // 0x01D0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_FIRE_RATE;                                      // 0x01D8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_FIRE_RATE_BUFF;                                 // 0x01E0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_CHARGE_DURATION;                                // 0x01E8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_CHARGE_DURATION_BUFF;                           // 0x01F0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_CHARGE_DAMAGE_INCREASE;                         // 0x01F8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_CHARGE_DAMAGE_INCREASE_BUFF;                    // 0x0200(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_CHARGE_PROJECTILE_INCREASE;                     // 0x0208(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_CHARGE_PROJECTILE_INCREASE_BUFF;                // 0x0210(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_CHARGE_BURST_INCREASE;                          // 0x0218(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_CHARGE_BURST_INCREASE_BUFF;                     // 0x0220(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_RAMP_UP_DURATION;                               // 0x0228(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_RAMP_UP_DURATION_BUFF;                          // 0x0230(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_VELOCITY;                                       // 0x0238(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_VELOCITY_BUFF;                                  // 0x0240(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_SPREAD;                                         // 0x0248(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_SPREAD_BUFF;                                    // 0x0250(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_ENERGY_CONSUMPTION;                             // 0x0258(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_ENERGY_CONSUMPTION_BUFF;                        // 0x0260(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DEVICE_COOLDOWN;                                       // 0x0268(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DEVICE_COOLDOWN_BUFF;                                  // 0x0270(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DEVICE_ENERGY_CONSUMPTION;                             // 0x0278(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DEVICE_ENERGY_CONSUMPTION_BUFF;                        // 0x0280(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DEVICE_EFFECT_DURATION;                                // 0x0288(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DEVICE_EFFECT_DURATION_BUFF;                           // 0x0290(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DEVICE_EFFECT;                                         // 0x0298(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DEVICE_EFFECT_BUFF;                                    // 0x02A0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DEVICE_EFFECT_3;                                       // 0x02A8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DEVICE_EFFECT_2_BUFF;                                  // 0x02B0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DEVICE_RANGE;                                          // 0x02B8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DEVICE_RANGE_BUFF;                                     // 0x02C0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DEVICE_EMP_STUN_DURATION;                              // 0x02C8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_PERK_EFFECT;                                           // 0x02D0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_PERK_EFFECT_3;                                         // 0x02D8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_PERK_COUNT;                                            // 0x02E0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_PERK_TIME;                                             // 0x02E8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_PERK_TIME_3;                                           // 0x02F0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_CONSUMABLE_EFFECT;                                     // 0x02F8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_CONSUMABLE_EFFECT_NUMBER;                              // 0x0300(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_CONSUMABLE_DURATION;                                   // 0x0308(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SECONDARY_MAX_AMMO;                                    // 0x0310(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ITEM_PRICE;                                            // 0x0318(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ITEM_STACK_AMOUNT;                                     // 0x0320(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ITEM_CONTENT;                                          // 0x0328(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ITEM_MISSION_ID;                                       // 0x0330(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SENSOR_RANGE;                                          // 0x0338(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SENSOR_RANGE_BUFF;                                     // 0x0340(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_TRACTOR_BEAM_RANGE;                                    // 0x0348(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_TRACTOR_BEAM_RANGE_BUFF;                               // 0x0350(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_COLLISION_DAMAGE;                                      // 0x0358(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_COLLISION_DAMAGE_BUFF;                                 // 0x0360(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SOCKETS;                                               // 0x0368(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_SHIELD_DPS;                                     // 0x0370(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_WEAPON_HULL_DPS;                                       // 0x0378(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_MODULE_DAMAGE_RESISTANCE;                              // 0x0380(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_NANO_BOT_REPAIR_AMOUNT;                                // 0x0388(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_NANO_BOT_REPAIR_SPEED;                                 // 0x0390(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_CRITICAL_HIT_DAMAGE;                                   // 0x0398(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_CRITICAL_HIT_CHANCE;                                   // 0x03A0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_CONDITION_RESISTANCE;                                  // 0x03A8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ELEMENTAL_RESISTANCE;                                  // 0x03B0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DIRECT_HULL_DAMAGE_RESISTANCE;                         // 0x03B8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_MAX_BANKING_ANGLE_YAW;                                 // 0x03C0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_MAX_BANKING_ANGLE_STRAFE;                              // 0x03C8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_BANKING_SPEED;                                         // 0x03D0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ACCELERATION_FORWARD;                                  // 0x03D8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ACCELERATION_BACKWARD;                                 // 0x03E0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ACCELERATION_STRAFE;                                   // 0x03E8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ACCELERATION_HOVER;                                    // 0x03F0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ROTATION_SPEED;                                        // 0x03F8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ROTATION_ACCELERATION;                                 // 0x0400(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SHIELD_PIERCING;                                       // 0x0408(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ARMOR_PIERCING;                                        // 0x0410(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ANTI_ARMOR;                                            // 0x0418(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_FORK;                                                  // 0x0420(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_LEECH;                                                 // 0x0428(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_HEAL_ON_HIT;                                           // 0x0430(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_HEAL_ON_KILL;                                          // 0x0438(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_JAMMING;                                               // 0x0440(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_REFLECT_SHOT;                                          // 0x0448(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SLOW;                                                  // 0x0450(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_CORROSION;                                             // 0x0458(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DOUBLE_SHOT;                                           // 0x0460(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ENERGY_PLUS;                                           // 0x0468(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_CREDITS_DROP;                                          // 0x0470(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_EXPLOSIVE_SHOT;                                        // 0x0478(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_DESTABILIZER;                                          // 0x0480(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_CRITICAL_HIT_CHAIN;                                    // 0x0488(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_EMP_POWERED_DEATH_BLOW;                                // 0x0490(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_FINAL_HELP;                                            // 0x0498(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_FULL_STOP;                                             // 0x04A0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ANCIENT_DAMAGE;                                        // 0x04A8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ENERGY_BUBBLE;                                         // 0x04B0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ENERGY_DEPENDENCE;                                     // 0x04B8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SHIELD_DISRUPT;                                        // 0x04C0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SHIELD_LEECH;                                          // 0x04C8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SHIELD_REFLECT;                                        // 0x04D0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SHUTDOWN_EMP;                                          // 0x04D8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_EMERGENCY_SHIELD;                                      // 0x04E0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_EXPERIENCE_PER_KILL;                                   // 0x04E8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_ELITE_DAMAGE;                                          // 0x04F0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_CREDITS_LOOT_BONUS;                                    // 0x04F8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_LOOT_EXPLOSION;                                        // 0x0500(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_INSTANT_SCRAP_PROCESSING;                              // 0x0508(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_CONTAINER_CLOAK;                                       // 0x0510(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_EMP_ENERGY_LEECH;                                      // 0x0518(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_FULL_AUTO;                                             // 0x0520(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ID_SYNERGY;                                               // 0x0528(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.AttributeIDs");
		return ptr;
	}

};


// Class ES2.BaseProjectileMovementComponent
// 0x0000 (0x0200 - 0x0200)
class UBaseProjectileMovementComponent : public UProjectileMovementComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.BaseProjectileMovementComponent");
		return ptr;
	}

};


// Class ES2.BTD_CompareBBEntriesArithmetic
// 0x0058 (0x00C0 - 0x0068)
class UBTD_CompareBBEntriesArithmetic : public UBTDecorator
{
public:
	TEnumAsByte<EArithmeticKeyOperation>               Operator;                                                 // 0x0068(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0069(0x0007) MISSED OFFSET
	struct FBlackboardKeySelector                      BlackboardKeyA;                                           // 0x0070(0x0028) (Edit)
	struct FBlackboardKeySelector                      BlackboardKeyB;                                           // 0x0098(0x0028) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.BTD_CompareBBEntriesArithmetic");
		return ptr;
	}

};


// Class ES2.BTD_TimeLimitFromWaypoint
// 0x0028 (0x0090 - 0x0068)
class UBTD_TimeLimitFromWaypoint : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                      WaypointKey;                                              // 0x0068(0x0028) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.BTD_TimeLimitFromWaypoint");
		return ptr;
	}

};


// Class ES2.BTD_TimeLimitVariance
// 0x0008 (0x0078 - 0x0070)
class UBTD_TimeLimitVariance : public UBTDecorator_TimeLimit
{
public:
	float                                              VariancePercent;                                          // 0x0070(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0074(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.BTD_TimeLimitVariance");
		return ptr;
	}

};


// Class ES2.BTS_CheckIfUnderAttack
// 0x0038 (0x00A8 - 0x0070)
class UBTS_CheckIfUnderAttack : public UBTService
{
public:
	struct FBlackboardKeySelector                      UnderAttackKey;                                           // 0x0070(0x0028) (Edit)
	float                                              FailCheckDistToTargetAimLocation;                         // 0x0098(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FailCheckAttackTimeThreshold;                             // 0x009C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FailCheckMinDistToTarget;                                 // 0x00A0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FailCheckMaxDistToTarget;                                 // 0x00A4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.BTS_CheckIfUnderAttack");
		return ptr;
	}

};


// Class ES2.BTS_DetectNearestEnemyNative
// 0x0030 (0x00A0 - 0x0070)
class UBTS_DetectNearestEnemyNative : public UBTService
{
public:
	struct FBlackboardKeySelector                      TargetKey;                                                // 0x0070(0x0028) (Edit)
	TEnumAsByte<EFactionRelation>                      SearchForRelation;                                        // 0x0098(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               SearchForDamagedHull;                                     // 0x0099(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               SearchForDamagedArmor;                                    // 0x009A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               SearchForDamagedShield;                                   // 0x009B(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               ConsiderWeaponCone;                                       // 0x009C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               ConsiderTurretCone;                                       // 0x009D(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               PreferOldTarget;                                          // 0x009E(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x009F(0x0001) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.BTS_DetectNearestEnemyNative");
		return ptr;
	}

};


// Class ES2.BTS_DetectTargetMissile
// 0x0028 (0x0098 - 0x0070)
class UBTS_DetectTargetMissile : public UBTService
{
public:
	struct FBlackboardKeySelector                      TargetKey;                                                // 0x0070(0x0028) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.BTS_DetectTargetMissile");
		return ptr;
	}

};


// Class ES2.BTT_FlyToAvoidCollision
// 0x0038 (0x00D0 - 0x0098)
class UBTT_FlyToAvoidCollision : public UBTTask_BlackboardBase
{
public:
	float                                              AcceptableRadiusDestination;                              // 0x0098(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AcceptableRadiusSubWaypoint;                              // 0x009C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ForceUpdateTime;                                          // 0x00A0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ForceUpdateTimeInterior;                                  // 0x00A4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                TestDirectionCount;                                       // 0x00A8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpeedReductionFactor;                                     // 0x00AC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AgilityReductionFactor;                                   // 0x00B0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              StrafeFactor;                                             // 0x00B4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              OversteerPreventionAngle;                                 // 0x00B8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              OvershootPreventionDistance;                              // 0x00BC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MovementPredictionTime;                                   // 0x00C0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TraceSamplingStepsPerSecond;                              // 0x00C4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               OrientLikeTargetIfNear;                                   // 0x00C8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bFailIfPassedTarget;                                      // 0x00C9(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EAIEvent>                              EventOnExecute;                                           // 0x00CA(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EAIEvent>                              EventOnFinished;                                          // 0x00CB(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00CC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.BTT_FlyToAvoidCollision");
		return ptr;
	}

};


// Class ES2.BTT_Attack
// 0x0010 (0x00E0 - 0x00D0)
class UBTT_Attack : public UBTT_FlyToAvoidCollision
{
public:
	bool                                               bFlyToOffsetLocation;                                     // 0x00D0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x00D1(0x0003) MISSED OFFSET
	float                                              MinFlyToOffset;                                           // 0x00D4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxFlyToOffset;                                           // 0x00D8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00DC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.BTT_Attack");
		return ptr;
	}

};


// Class ES2.BTT_BarrelRollEvasiveMove
// 0x0010 (0x00E0 - 0x00D0)
class UBTT_BarrelRollEvasiveMove : public UBTT_FlyToAvoidCollision
{
public:
	float                                              RollFactor;                                               // 0x00D0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              StrafeMultiplier;                                         // 0x00D4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TimeLimitSeconds;                                         // 0x00D8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00DC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.BTT_BarrelRollEvasiveMove");
		return ptr;
	}

};


// Class ES2.BTT_CalcIdleLocation
// 0x0060 (0x00F8 - 0x0098)
class UBTT_CalcIdleLocation : public UBTTask_BlackboardBase
{
public:
	float                                              IdleRadius;                                               // 0x0098(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EIdleType>                             IdleType;                                                 // 0x009C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x009D(0x0003) MISSED OFFSET
	float                                              MaxRadiusAroundTarget;                                    // 0x00A0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00A4(0x0004) MISSED OFFSET
	struct FBlackboardKeySelector                      TargetKey;                                                // 0x00A8(0x0028) (Edit)
	struct FBlackboardKeySelector                      CurrentIdleTypeKey;                                       // 0x00D0(0x0028) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.BTT_CalcIdleLocation");
		return ptr;
	}

};


// Class ES2.BTT_CalcRailTurretPatrolLocation
// 0x0008 (0x00A0 - 0x0098)
class UBTT_CalcRailTurretPatrolLocation : public UBTTask_BlackboardBase
{
public:
	float                                              AcceptableRadiusDestination;                              // 0x0098(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x009C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.BTT_CalcRailTurretPatrolLocation");
		return ptr;
	}

};


// Class ES2.BTT_ChromagoreFlyTo
// 0x0028 (0x00F8 - 0x00D0)
class UBTT_ChromagoreFlyTo : public UBTT_FlyToAvoidCollision
{
public:
	struct FBlackboardKeySelector                      ArrivedAtTargetKey;                                       // 0x00D0(0x0028) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.BTT_ChromagoreFlyTo");
		return ptr;
	}

};


// Class ES2.BTT_DebugMessage
// 0x0018 (0x0088 - 0x0070)
class UBTT_DebugMessage : public UBTTaskNode
{
public:
	class FString                                      DebugText;                                                // 0x0070(0x0010) (Edit, ZeroConstructor)
	TEnumAsByte<EBTNodeResult>                         NodeResult;                                               // 0x0080(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0081(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.BTT_DebugMessage");
		return ptr;
	}

};


// Class ES2.BTT_FlyAwayFrom
// 0x0020 (0x0100 - 0x00E0)
class UBTT_FlyAwayFrom : public UBTT_Attack
{
public:
	float                                              FlyByDistanceThreshold;                                   // 0x00E0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FlyBySafetyDistance;                                      // 0x00E4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 ZigZagSegmentLength;                                      // 0x00E8(0x0010) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ZigZagMaxDeviationAngle;                                  // 0x00F8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00FC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.BTT_FlyAwayFrom");
		return ptr;
	}

};


// Class ES2.BTT_FollowLeader
// 0x0020 (0x00F0 - 0x00D0)
class UBTT_FollowLeader : public UBTT_FlyToAvoidCollision
{
public:
	float                                              FormationPosOvershootPreventionDist;                      // 0x00D0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 CatchUpAiEventsThreshold;                                 // 0x00D4(0x0010) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              CollisionSensingDistanceInFormation;                      // 0x00E4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              WaypointUpdateIntervalIndoors;                            // 0x00E8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00EC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ES2.BTT_FollowLeader");
		return ptr;
	}


	bool STATIC_TryTeleportIntoFormation(class AESPawn** Follower);
};


// Class ES2.BTT_FormationAttack
// 0x0028 (0x0118 - 0x00F0)
class UBTT_FormationAttack : public UBTT_FollowLeader
{
public:
