#pragma once

// Everspace2_Prototype SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ES2_Basic.hpp"
#include "ES2_Engine_classes.hpp"
#include "ES2_SlateCore_classes.hpp"
#include "ES2_CoreUObject_classes.hpp"
#include "ES2_AIModule_classes.hpp"
#include "ES2_UMG_classes.hpp"
#include "ES2_InputCore_classes.hpp"
#include "ES2_MovieScene_classes.hpp"
#include "ES2_ProceduralMeshComponent_classes.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum ES2.EJumpAbortType
enum class EJumpAbortType : uint8_t
{
	None                           = 0,
	Manual                         = 1,
	Obstacle                       = 2,
	EscapeVector                   = 3,
	Enemies                        = 4,
	JumpSuppressor                 = 5,
	MissionActive                  = 6,
	MissionDialogActive            = 7,
	EJumpAbortType_MAX             = 8
};


// Enum ES2.EJumpMethod
enum class EJumpMethod : uint8_t
{
	None                           = 0,
	JumpDriveToSystem              = 1,
	JumpDriveToLocation            = 2,
	JumpGateToLocation             = 3,
	WormholeToLocation             = 4,
	TeleporterToLocation           = 5,
	EJumpMethod_MAX                = 6
};


// Enum ES2.EAIEvent
enum class EAIEvent : uint8_t
{
	Invalid                        = 0,
	OnBeginIdle                    = 1,
	OnBeginAttack                  = 2,
	OnBeginIsTailed                = 3,
	OnBeginFlee                    = 4,
	OnBeginGainDistance            = 5,
	OnBeginKamikazeApproach        = 6,
	OnSelfDestruct                 = 7,
	OnBeginTravelToTarget          = 8,
	OnEndTravelToTarget            = 9,
	OnArrivedAtHangar              = 10,
	OnBeginCatchUpWithLeader       = 11,
	OnEndCatchUpWithLeader         = 12,
	OnTakeoff                      = 13,
	OnEndIdle                      = 14,
	OnEndAttack                    = 15,
	OnEndIsTailed                  = 16,
	OnEndFlee                      = 17,
	OnEndGainDistance              = 18,
	OnBeginInvestigate             = 19,
	OnEndInvestigate               = 20,
	OnWaypointReached              = 21,
	OnFleeFromTurnfight            = 22,
	OnJump                         = 23,
	OnBeginBarrelRoll              = 24,
	OnEndBarrelRoll                = 25,
	OnBeginSpecialAttack           = 26,
	OnEndSpecialAttack             = 27,
	OnNoLeader                     = 28,
	EAIEvent_MAX                   = 29
};


// Enum ES2.EInteractWidgetDisplayLocation
enum class EInteractWidgetDisplayLocation : uint8_t
{
	ScreenCenter                   = 0,
	ActorLocation                  = 1,
	EInteractWidgetDisplayLocation_MAX = 2
};


// Enum ES2.EActivityHudMarkerType
enum class EActivityHudMarkerType : uint8_t
{
	None                           = 0,
	ShadowCreature                 = 1,
	RaceStart                      = 2,
	RaceGate                       = 3,
	RaceNextRing                   = 4,
	RaceRingAfterNextRing          = 5,
	RaceFinish                     = 6,
	EActivityHudMarkerType_MAX     = 7
};


// Enum ES2.ELocationCategory
enum class ELocationCategory : uint8_t
{
	None                           = 0,
	Generic                        = 1,
	DistressCall                   = 2,
	Resources                      = 3,
	Interception                   = 4,
	Count                          = 5,
	ELocationCategory_MAX          = 6
};


// Enum ES2.EPawnType
enum class EPawnType : uint8_t
{
	Undefined                      = 0,
	Drone                          = 1,
	Fighter                        = 2,
	Cruiser                        = 3,
	Capital                        = 4,
	Freighter                      = 5,
	Turret                         = 6,
	Creature                       = 7,
	EPawnType_MAX                  = 8
};


// Enum ES2.ERegisterIds
enum class ERegisterIds : uint8_t
{
	INVALID                        = 0,
	NONE                           = 1,
	Pawn                           = 2,
	ShipComponent                  = 3,
	Waypoint                       = 4,
	Missile                        = 5,
	PointOfInterest                = 6,
	HUDMarkerComponent             = 7,
	Pickup                         = 8,
	Resource                       = 9,
	JumpTarget                     = 10,
	DockingPoint                   = 11,
	Container                      = 12,
	Mission                        = 13,
	SpawnGizmo                     = 14,
	Perk                           = 15,
	TravelModeLocation             = 16,
	TravelModePlanet               = 17,
	JumpGate                       = 18,
	Mine                           = 19,
	POISpawner                     = 20,
	NavNode                        = 21,
	SpawnGizmoSelector             = 22,
	AreaGate                       = 23,
	OutlawStationStructure         = 24,
	Sequence                       = 25,
	EscapeTarget                   = 26,
	Activity                       = 27,
	Creature                       = 28,
	Glyph                          = 29,
	LocationInfo                   = 30,
	Count                          = 31,
	ERegisterIds_MAX               = 32
};


// Enum ES2.EMarkerRelation
enum class EMarkerRelation : uint8_t
{
	Friend                         = 0,
	Neutral                        = 1,
	Enemy                          = 2,
	NoRelation                     = 3,
	EMarkerRelation_MAX            = 4
};


// Enum ES2.EMarkerLook
enum class EMarkerLook : uint8_t
{
	OnScreen                       = 0,
	OffScreen                      = 1,
	EMarkerLook_MAX                = 2
};


// Enum ES2.EFactions
enum class EFactions : uint8_t
{
	Undefined                      = 0,
	Player                         = 1,
	PlayerFriend                   = 2,
	GradyAndBrunt                  = 3,
	Freelancer                     = 4,
	BountyHunter                   = 5,
	Okkar                          = 6,
	Outlaw                         = 7,
	OutlawRaven                    = 8,
	OutlawCrow                     = 9,
	OutlawCoalition                = 10,
	Scavenger                      = 11,
	RogueAI                        = 12,
	Ancient                        = 13,
	CloneHunter                    = 14,
	ElekGang                       = 15,
	CreatureHostile                = 16,
	CreatureNeutral                = 17,
	Count                          = 18,
	EFactions_MAX                  = 19
};


// Enum ES2.EItemRarity
enum class EItemRarity : uint8_t
{
	None                           = 0,
	Common                         = 1,
	Uncommon                       = 2,
	Enhanced                       = 3,
	Rare                           = 4,
	Legendary                      = 5,
	EItemRarity_MAX                = 6
};


// Enum ES2.EDialog
enum class EDialog : uint8_t
{
	Undefined                      = 0,
	SmallTalk                      = 1,
	Lore                           = 2,
	GenericMission                 = 3,
	MainMission                    = 4,
	Movie                          = 5,
	EDialog_MAX                    = 6
};


// Enum ES2.EEscapeTargetState
enum class EEscapeTargetState : uint8_t
{
	Countdown                      = 0,
	InPorgress                     = 1,
	Won                            = 2,
	Lost                           = 3,
	EEscapeTargetState_MAX         = 4
};


// Enum ES2.EActivityType
enum class EActivityType : uint8_t
{
	Invalid                        = 0,
	Activatable                    = 1,
	Passive                        = 2,
	EActivityType_MAX              = 3
};


// Enum ES2.EActivityState
enum class EActivityState : uint8_t
{
	Invalid                        = 0,
	InactiveAndHidden              = 1,
	Inactive                       = 2,
	Active                         = 3,
	Failed                         = 4,
	Succeeded                      = 5,
	Aborted                        = 6,
	AbortedAndHidden               = 7,
	EActivityState_MAX             = 8
};


// Enum ES2.EActorPoolExpansion
enum class EActorPoolExpansion : uint8_t
{
	INCREMENT                      = 0,
	Double                         = 1,
	EActorPoolExpansion_MAX        = 2
};


// Enum ES2.EIdleType
enum class EIdleType : uint8_t
{
	CouchAtHome                    = 0,
	MothAtHome                     = 1,
	MothAtTarget                   = 2,
	StraightFlight                 = 3,
	VisitPOIs                      = 4,
	VisitSurfacePoints             = 5,
	VisitPointsAroundTarget        = 6,
	ReadFromPawn                   = 7,
	CouchAtPosition                = 8,
	EIdleType_MAX                  = 9
};


// Enum ES2.EOrbitType
enum class EOrbitType : uint8_t
{
	SphereCapSurface               = 0,
	SphereCapSurfaceTrgt           = 1,
	KeepDirectionOnHorizontalOrbit = 2,
	KeepPositionOnSphereCapSurface = 3,
	EOrbitType_MAX                 = 4
};


// Enum ES2.EAttributeOp
enum class EAttributeOp : uint8_t
{
	AddFixValue                    = 0,
	AddFraction                    = 1,
	SetValue                       = 2,
	Multiply                       = 3,
	AddFixValueLast                = 4,
	Invalid                        = 5,
	EAttributeOp_MAX               = 6
};


// Enum ES2.EConditionStacktype
enum class EConditionStacktype : uint8_t
{
	Intensity                      = 0,
	Duration                       = 1,
	EConditionStacktype_MAX        = 2
};


// Enum ES2.EDeviceType
enum class EDeviceType : uint8_t
{
	Active                         = 0,
	Passive                        = 1,
	EDeviceType_MAX                = 2
};


// Enum ES2.ESpeakerMood
enum class ESpeakerMood : uint8_t
{
	Normal                         = 0,
	Happy                          = 1,
	Shocked                        = 2,
	Angry                          = 3,
	Sad                            = 4,
	Cunning                        = 5,
	ESpeakerMood_MAX               = 6
};


// Enum ES2.EBusyness
enum class EBusyness : uint8_t
{
	None                           = 0,
	Low                            = 1,
	Medium                         = 2,
	High                           = 3,
	EBusyness_MAX                  = 4
};


// Enum ES2.EDockingState
enum class EDockingState : uint8_t
{
	Free                           = 0,
	Approaching                    = 1,
	Landing                        = 2,
	Landed                         = 3,
	Launching                      = 4,
	EDockingState_MAX              = 5
};


// Enum ES2.EEquipmentInstallResult
enum class EEquipmentInstallResult : uint8_t
{
	Fail                           = 0,
	Success                        = 1,
	InsufficientResources          = 2,
	NoFreeSlots                    = 3,
	ModLimitReached                = 4,
	ModIncompatible                = 5,
	AmmoLimitReached               = 6,
	SameEquipmentAlreadyInstalled  = 7,
	IncompatibleShip               = 8,
	EEquipmentInstallResult_MAX    = 9
};


// Enum ES2.EEquipmentType
enum class EEquipmentType : uint8_t
{
	Consumable                     = 0,
	Device                         = 1,
	PrimaryWeapon                  = 2,
	SecondaryWeapon                = 3,
	Mod                            = 4,
	Any                            = 5,
	Buff                           = 6,
	None                           = 7,
	EEquipmentType_MAX             = 8
};


// Enum ES2.EControllerIconStyle
enum class EControllerIconStyle : uint8_t
{
	_Invalid_                      = 0,
	XBoxOne                        = 1,
	PS4                            = 2,
	Count                          = 3,
	EControllerIconStyle_MAX       = 4
};


// Enum ES2.EJoystickHUDBehavior
enum class EJoystickHUDBehavior : uint8_t
{
	_Invalid_                      = 0,
	Keyboard                       = 1,
	Gamepad                        = 2,
	Count                          = 3,
	EJoystickHUDBehavior_MAX       = 4
};


// Enum ES2.EInputPreset
enum class EInputPreset : uint8_t
{
	_Invalid_                      = 0,
	Custom                         = 1,
	MouseKeyboard                  = 2,
	GamepadScheme0                 = 3,
	GamepadScheme1                 = 4,
	GamepadScheme3                 = 5,
	GamepadScheme4                 = 6,
	Empty                          = 7,
	Count                          = 8,
	EInputPreset_MAX               = 9
};


// Enum ES2.EInputActionName
enum class EInputActionName : uint8_t
{
	_Invalid_                      = 0,
	ActionFreeze                   = 1,
	Boost                          = 2,
	Cancel                         = 3,
	CameraMoveForward              = 4,
	CameraMoveRight                = 5,
	CameraMoveUp                   = 6,
	CameraPitch                    = 7,
	CameraRoll                     = 8,
	CameraYaw                      = 9,
	CameraZoom                     = 10,
	ChargeCruiseMode               = 11,
	ChargeTravelMode               = 12,
	Consumable1                    = 13,
	Consumable2                    = 14,
	Consumable3                    = 15,
	Consumable4                    = 16,
	Device1                        = 17,
	Device2                        = 18,
	Device3                        = 19,
	Device4                        = 20,
	DisplayControls                = 21,
	FirePrimary                    = 22,
	FireSecondary                  = 23,
	FreeLook                       = 24,
	Headlight                      = 25,
	HighResScreenshot              = 26,
	IngameMenu                     = 27,
	Interact                       = 28,
	Inventory                      = 29,
	LockTarget                     = 30,
	LockNearestTarget              = 31,
	Map                            = 32,
	MenuAction2                    = 33,
	MenuAction3                    = 34,
	MenuChangeCompare              = 35,
	MoveForward                    = 36,
	MoveRight                      = 37,
	MoveUp                         = 38,
	NavigateAllFull                = 39,
	NavigateAllEmpty               = 40,
	NavigateDown                   = 41,
	NavigateLeft                   = 42,
	NavigateRight                  = 43,
	NavigateUp                     = 44,
	NextPrimary                    = 45,
	NextSecondary                  = 46,
	NextTarget                     = 47,
	OK                             = 48,
	Pause                          = 49,
	Pitch                          = 50,
	PreviousPrimary                = 51,
	PreviousSecondary              = 52,
	PreviousTarget                 = 53,
	Roll                           = 54,
	Scroll                         = 55,
	SubTabLeft                     = 56,
	SubTabRight                    = 57,
	SwitchCamera                   = 58,
	TabLeft                        = 59,
	TabRight                       = 60,
	ToggleFlightMode               = 61,
	ToggleHUD                      = 62,
	UseConsumable                  = 63,
	UseDevice                      = 64,
	Yaw                            = 65,
	Count                          = 66,
	EInputActionName_MAX           = 67
};


// Enum ES2.EIndicator
enum class EIndicator : uint8_t
{
	Invalid                        = 0,
	MainMission                    = 1,
	SideMission                    = 2,
	Job                            = 3,
	Waypoint                       = 4,
	Homebase                       = 5,
	JumpGate                       = 6,
	Wormhole                       = 7,
	ItemShop                       = 8,
	ShipDealer                     = 9,
	JobBoard                       = 10,
	Debuffed                       = 11,
	EIndicator_MAX                 = 12
};


// Enum ES2.ETypeOfDamage
enum class ETypeOfDamage : uint8_t
{
	Energy                         = 0,
	Kinetic                        = 1,
	Generic                        = 2,
	ETypeOfDamage_MAX              = 3
};


// Enum ES2.EJobType
enum class EJobType : uint8_t
{
	Undefined                      = 0,
	Job_Mining                     = 1,
	Job_Space_Junk                 = 2,
	Job_Maintenance                = 3,
	Job_Deliver_Items              = 4,
	Job_Lost_Found                 = 5,
	Job_Move_Containers            = 6,
	Job_Defend_Mining              = 7,
	Job_Attack_Outlaws             = 8,
	Job_Destroy_Freighters         = 9,
	Job_Attack_GB                  = 10,
	Job_Destroy_Scavengers         = 11,
	Job_Graffiti                   = 12,
	Job_Billboards                 = 13,
	Job_Taxi                       = 14,
	Job_Transport                  = 15,
	Job_Transport_Timed            = 16,
	Job_Racing                     = 17,
	Job_Assassination              = 18,
	Job_Reconnaissance             = 19,
	Count                          = 20,
	EJobType_MAX                   = 21
};


// Enum ES2.EAreaEnvironment
enum class EAreaEnvironment : uint8_t
{
	Undefined                      = 0,
	Exterior                       = 1,
	Interior                       = 2,
	Count                          = 3,
	EAreaEnvironment_MAX           = 4
};


// Enum ES2.EFactionRelation
enum class EFactionRelation : uint8_t
{
	Undefined                      = 0,
	Neutral                        = 1,
	Enemy                          = 2,
	Friend                         = 3,
	Count                          = 4,
	EFactionRelation_MAX           = 5
};


// Enum ES2.EFactionGroup
enum class EFactionGroup : uint8_t
{
	Undefined                      = 0,
	GradyAndBrunt_Mining           = 1,
	GradyAndBrunt_Trading          = 2,
	GradyAndBrunt_Defense          = 3,
	EnvMilitant                    = 4,
	EnvPacifist                    = 5,
	BeltagradesUnite               = 6,
	DMZPizza                       = 7,
	TradingGuild                   = 8,
	RacingLeague                   = 9,
	BountyHunter_Union             = 10,
	Okkar_DMZAffairs               = 11,
	Count                          = 12,
	EFactionGroup_MAX              = 13
};


// Enum ES2.EGraphicsQuality
enum class EGraphicsQuality : uint8_t
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Epic                           = 3,
	EGraphicsQuality_MAX           = 4
};


// Enum ES2.ELogMessage
enum class ELogMessage : uint8_t
{
	PlainMessage                   = 0,
	ItemPickup                     = 1,
	ConditionAdded                 = 2,
	ELogMessage_MAX                = 3
};


// Enum ES2.ETargetPriority
enum class ETargetPriority : uint8_t
{
	Default                        = 0,
	TargetPreference               = 1,
	Aggro                          = 2,
	BlindFury                      = 3,
	Override                       = 4,
	COUNT                          = 5,
	ETargetPriority_MAX            = 6
};


// Enum ES2.ENotifyAllies
enum class ENotifyAllies : uint8_t
{
	Notify_NoOne                   = 0,
	Notify_InRangeRecursive        = 1,
	Notify_All                     = 2,
	Notify_MAX                     = 3
};


// Enum ES2.EMenuTab
enum class EMenuTab : uint8_t
{
	Invalid                        = 0,
	StationHome                    = 1,
	Ship                           = 2,
	Hangar                         = 3,
	ItemShop                       = 4,
	ShipDealer                     = 5,
	Workshop                       = 6,
	Management                     = 7,
	Refinery                       = 8,
	Communications                 = 9,
	BlackMarket                    = 10,
	Map                            = 11,
	Missions                       = 12,
	Stats                          = 13,
	Jobs                           = 14,
	Loot                           = 15,
	EMenuTab_MAX                   = 16
};


// Enum ES2.EMenuType
enum class EMenuType : uint8_t
{
	Ingame                         = 0,
	Station                        = 1,
	Homebase                       = 2,
	Loot                           = 3,
	Count                          = 4,
	EMenuType_MAX                  = 5
};


// Enum ES2.EInventorySearchType
enum class EInventorySearchType : uint8_t
{
	InStorageOrAnyShip             = 0,
	InStorageOrCurrentShip         = 1,
	InStorageOnly                  = 2,
	InCurrentShipCargoOnly         = 3,
	InAnyShip                      = 4,
	EInventorySearchType_MAX       = 5
};


// Enum ES2.EMarkerScalingMethod
enum class EMarkerScalingMethod : uint8_t
{
	MaxDimension                   = 0,
	MinDimension                   = 1,
	X                              = 2,
	Y                              = 3,
	Z                              = 4,
	EMarkerScalingMethod_MAX       = 5
};


// Enum ES2.EAttackOnPlayer
enum class EAttackOnPlayer : uint8_t
{
	None                           = 0,
	Normal                         = 1,
	Web                            = 2,
	Scan                           = 3,
	EAttackOnPlayer_MAX            = 4
};


// Enum ES2.EInteractState
enum class EInteractState : uint8_t
{
	Idle                           = 0,
	HoldingKey                     = 1,
	Charging                       = 2,
	ReadyToInteract                = 3,
	Interacted                     = 4,
	Done                           = 5,
	EInteractState_MAX             = 6
};


// Enum ES2.EInteractWidgetHUDMarkerBehavior
enum class EInteractWidgetHUDMarkerBehavior : uint8_t
{
	HideMarkerDetails              = 0,
	AttachToHUDMarker              = 1,
	ShowBoth                       = 2,
	EInteractWidgetHUDMarkerBehavior_MAX = 3
};


// Enum ES2.EShipBuyResult
enum class EShipBuyResult : uint8_t
{
	Success                        = 0,
	LevelTooLow                    = 1,
	NotEnoughCredits               = 2,
	NotEnoughSpaceOnHomebase       = 3,
	NotEnoughCargoForItemTransfer  = 4,
	MiscError                      = 5,
	EShipBuyResult_MAX             = 6
};


// Enum ES2.EShipBuyMode
enum class EShipBuyMode : uint8_t
{
	SendNewToHomebase              = 0,
	SendOldToHomebase              = 1,
	SellOld                        = 2,
	CheatReplaceCurrentShip        = 3,
	EShipBuyMode_MAX               = 4
};


// Enum ES2.EInventoryCategory
enum class EInventoryCategory : uint8_t
{
	PrimaryWeapon                  = 0,
	SecondaryWeapon                = 1,
	EnergyCore                     = 2,
	Sensor                         = 3,
	Shield                         = 4,
	CargoUnit                      = 5,
	Plating                        = 6,
	Thrusters                      = 7,
	Device                         = 8,
	Consumable                     = 9,
	Cargo                          = 10,
	INVALID                        = 11,
	EInventoryCategory_MAX         = 12
};


// Enum ES2.EAttributeFormat
enum class EAttributeFormat : uint8_t
{
	Float                          = 0,
	Percent                        = 1,
	Int                            = 2,
	EAttributeFormat_MAX           = 3
};


// Enum ES2.EContainerType
enum class EContainerType : uint8_t
{
	OpenOnHit                      = 0,
	OpenOnInteract                 = 1,
	OpenOnUnlocked                 = 2,
	AlreadyOpenedNoContainer       = 3,
	EContainerType_MAX             = 4
};


// Enum ES2.EPOIType
enum class EPOIType : uint8_t
{
	Invalid                        = 0,
	Small                          = 1,
	Medium                         = 2,
	Large                          = 3,
	Main                           = 4,
	EPOIType_MAX                   = 5
};


// Enum ES2.ESpawnGroup
enum class ESpawnGroup : uint8_t
{
	INVALID                        = 0,
	PlacedInEditor                 = 1,
	SpawnedDuringPlay              = 2,
	LocationBusyness               = 3,
	START_NPCS                     = 4,
	GnB                            = 5,
	GnB_Mixed                      = 6,
	GnB_Cargo                      = 7,
	GnB_Capital                    = 8,
	GnB_Dockables                  = 9,
	Okkar                          = 10,
	Okkar_Mixed                    = 11,
	Okkar_Drones                   = 12,
	Okkar_Swarm                    = 13,
	Okkar_Interceptors             = 14,
	Okkar_Capital                  = 15,
	Outlaw                         = 16,
	Outlaw_Mixed                   = 17,
	Outlaw_Drones                  = 18,
	Outlaw_Capital                 = 19,
	Outlaw_Dockables               = 20,
	Freelancer                     = 21,
	Freelancer_Dockables           = 22,
	Mercenary                      = 23,
	Scavenger                      = 24,
	Asteroid_Crawler               = 25,
	Scrap_Anemone                  = 26,
	Plasma_Jellyfish               = 27,
	START_CONTAINERS               = 28,
	Container_Generic              = 29,
	Container_Rare                 = 30,
	Container_Tech                 = 31,
	Container_GnB                  = 32,
	START_RESOURCES                = 33,
	Resource_Crystal               = 34,
	Resource_Crystal_Atheum        = 35,
	Resource_Crystal_Vardum        = 36,
	Resource_Ore                   = 37,
	Resource_Ore_Iron              = 38,
	Resource_Ore_Copper            = 39,
	Resource_Ore_Diluted_Osnil     = 40,
	Resource_Ore_Glacit            = 41,
	Resource_Ore_Silver            = 42,
	Resource_Ore_Clymouth          = 43,
	Resource_Ore_Osnil             = 44,
	Resource_Ore_Osnil_Core        = 45,
	Resource_Ore_Stakk             = 46,
	Resource_Ore_Gold              = 47,
	Resource_Ore_Clymouth_Core     = 48,
	Resource_Ore_Flawless_Osnil    = 49,
	Resource_Ore_Titanium          = 50,
	Resource_Ore_Stakk_Core        = 51,
	Resource_Ore_Neptan            = 52,
	Resource_Ore_Wighord           = 53,
	Resource_Ore_Wighord_Core      = 54,
	Resource_Dark_Matter           = 55,
	Resource_Plasma                = 56,
	COUNT                          = 57,
	ESpawnGroup_MAX                = 58
};


// Enum ES2.ELootType
enum class ELootType : uint8_t
{
	NoLoot                         = 0,
	Drone                          = 1,
	Fighter                        = 2,
	HeavyFighter                   = 3,
	Cruiser                        = 4,
	CapitalShip                    = 5,
	Turret                         = 6,
	Junk                           = 7,
	Credits                        = 8,
	Weapons                        = 9,
	Modules                        = 10,
	Equipment                      = 11,
	Commodities                    = 12,
	Job                            = 13,
	Resources                      = 14,
	OutlawStation                  = 15,
	Container                      = 16,
	FreightContainer               = 17,
	ELootType_MAX                  = 18
};


// Enum ES2.EItemNameElementType
enum class EItemNameElementType : uint8_t
{
	Prefix                         = 0,
	Adjective                      = 1,
	Title                          = 2,
	Suffix                         = 3,
	Invalid                        = 4,
	EItemNameElementType_MAX       = 5
};


// Enum ES2.EShipModule
enum class EShipModule : uint8_t
{
	Body                           = 0,
	Wings                          = 1,
	Rear                           = 2,
	Extension                      = 3,
	Base                           = 4,
	Cockpit                        = 5,
	Invalid                        = 6,
	EShipModule_MAX                = 7
};


// Enum ES2.EShip
enum class EShip : uint8_t
{
	_Invalid                       = 0,
	AssaultFighter                 = 1,
	Bomber                         = 2,
	Defender                       = 3,
	Interceptor                    = 4,
	Gunship                        = 5,
	PatrolShip                     = 6,
	Scout                          = 7,
	Sentinel                       = 8,
	SpecOps                        = 9,
	EShip_MAX                      = 10
};


// Enum ES2.ELocationType
enum class ELocationType : uint8_t
{
	Normal                         = 0,
	LowOrbit                       = 1,
	Surface                        = 2,
	Composite                      = 3,
	Temporary                      = 4,
	ELocationType_MAX              = 5
};


// Enum ES2.ELocationConnection
enum class ELocationConnection : uint8_t
{
	Beacon                         = 0,
	JumpGate                       = 1,
	Surface                        = 2,
	Wormhole                       = 3,
	Teleporter                     = 4,
	ELocationConnection_MAX        = 5
};


// Enum ES2.EMissionLocation
enum class EMissionLocation : uint8_t
{
	NormalLocation                 = 0,
	NormalOrTemporaryLocation      = 1,
	TemporaryLocation              = 2,
	EMissionLocation_MAX           = 3
};


// Enum ES2.EMissionType
enum class EMissionType : uint8_t
{
	Side                           = 0,
	Main                           = 1,
	Job                            = 2,
	Encounter                      = 3,
	Any                            = 4,
	EMissionType_MAX               = 5
};


// Enum ES2.EMissionTaskTimeLimit
enum class EMissionTaskTimeLimit : uint8_t
{
	NoTimeLimit                    = 0,
	TimeLimitWithFail              = 1,
	TimeLimitWithoutFail           = 2,
	EMissionTaskTimeLimit_MAX      = 3
};


// Enum ES2.EMissionTaskDisplayType
enum class EMissionTaskDisplayType : uint8_t
{
	OnlyWhenUpdated                = 0,
	Always                         = 1,
	AlwaysAtTaskLocation           = 2,
	EMissionTaskDisplayType_MAX    = 3
};


// Enum ES2.EMissionTaskState
enum class EMissionTaskState : uint8_t
{
	Invalid                        = 0,
	InactiveAndHidden              = 1,
	Inactive                       = 2,
	Active                         = 3,
	Failed                         = 4,
	Succeeded                      = 5,
	Aborted                        = 6,
	AbortedAndHidden               = 7,
	EMissionTaskState_MAX          = 8
};


// Enum ES2.EQuestItem
enum class EQuestItem : uint8_t
{
	Package                        = 0,
	Delivery                       = 1,
	Goods                          = 2,
	Towels                         = 3,
	EnergyCore                     = 4,
	DNA                            = 5,
	None                           = 6,
	EQuestItem_MAX                 = 7
};


// Enum ES2.EPickupType
enum class EPickupType : uint8_t
{
	Collectible                    = 0,
	Resource                       = 1,
	Commodity                      = 2,
	Credits                        = 3,
	Device                         = 4,
	DeviceMod                      = 5,
	PrimaryWeapon                  = 6,
	SecondaryWeapon                = 7,
	Consumable                     = 8,
	QuestItem                      = 9,
	EPickupType_MAX                = 10
};


// Enum ES2.ESpawnMethod
enum class ESpawnMethod : uint8_t
{
	SpawnedDuringPlay              = 0,
	SpawnedFromLocationPool        = 1,
	SpawnedFromDockingStation      = 2,
	SpawnedForLocationBusyness     = 3,
	PlacedInEditor                 = 4,
	SpawnedByMission               = 5,
	SpawnedFromWingmen             = 6,
	Other                          = 7,
	ESpawnMethod_MAX               = 8
};


// Enum ES2.EEngineOpacityControlledBy
enum class EEngineOpacityControlledBy : uint8_t
{
	Transform                      = 0,
	Sequencer                      = 1,
	Input                          = 2,
	EEngineOpacityControlledBy_MAX = 3
};


// Enum ES2.ESequenceType
enum class ESequenceType : uint8_t
{
	None                           = 0,
	CanBeCanceled                  = 1,
	Docking                        = 2,
	CannotBeCanceled               = 3,
	ESequenceType_MAX              = 4
};


// Enum ES2.ESystemRegion
enum class ESystemRegion : uint8_t
{
	Invalid                        = 0,
	S01A                           = 1,
	S01B                           = 2,
	S01C                           = 3,
	S01D                           = 4,
	S01E                           = 5,
	S01F                           = 6,
	S01G                           = 7,
	S02A                           = 8,
	S02B                           = 9,
	S02C                           = 10,
	S02D                           = 11,
	S02E                           = 12,
	S02F                           = 13,
	S02G                           = 14,
	S08A                           = 15,
	S08B                           = 16,
	S08C                           = 17,
	S08D                           = 18,
	S08E                           = 19,
	S08F                           = 20,
	S08G                           = 21,
	ESystemRegion_MAX              = 22
};


// Enum ES2.EWeaponImpact
enum class EWeaponImpact : uint8_t
{
	Shield                         = 0,
	Armor                          = 1,
	Hull                           = 2,
	EWeaponImpact_MAX              = 3
};


// Enum ES2.EWeaponCategory
enum class EWeaponCategory : uint8_t
{
	Primary                        = 0,
	Secondary                      = 1,
	EWeaponCategory_MAX            = 2
};


// Enum ES2.ETargetSearchStrategy
enum class ETargetSearchStrategy : uint8_t
{
	AnyClosestToCrosshair          = 0,
	NearestEnemy                   = 1,
	ETargetSearchStrategy_MAX      = 2
};


// Enum ES2.WidgetPauseMode
enum class EWidgetPauseMode : uint8_t
{
	KeepPrevious                   = 0,
	PauseGame                      = 1,
	WidgetPauseMode_MAX            = 2
};


// Enum ES2.WidgetStackType
enum class EWidgetStackType : uint8_t
{
	GameHud                        = 0,
	GameMenu                       = 1,
	IngameDialogModal              = 2,
	GameModalDialog                = 3,
	OsModalDialog                  = 4,
	VRFadeScreen                   = 5,
	Count                          = 6,
	WidgetStackType_MAX            = 7
};


// Enum ES2.EGainCondition
enum class EGainCondition : uint8_t
{
	HealthDepleted                 = 0,
	MissionCompleted               = 1,
	Manual                         = 2,
	EGainCondition_MAX             = 3
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct ES2.ESVariant
// 0x0018
struct FESVariant
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct ES2.ActivityReward
// 0x001C
struct FActivityReward
{
	struct FName                                       ItemID;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       CategoryID;                                               // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EItemRarity>                           ItemRarity;                                               // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	int                                                Amount;                                                   // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ItemLevel;                                                // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ES2.ActivitySaveGameData
// 0x0080
struct FActivitySaveGameData
{
	class UClass*                                      ActivityClass;                                            // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       ActivityID;                                               // 0x0008(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EActivityState                                     State;                                                    // 0x0010(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	struct FName                                       LocationID;                                               // 0x0014(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	TMap<struct FName, struct FESVariant>              Attributes;                                               // 0x0020(0x0050) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FActivityReward>                     Rewards;                                                  // 0x0070(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct ES2.BuffableFloat
// 0x0040
struct FBuffableFloat
{
	float                                              BaseValue;                                                // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3C];                                      // 0x0004(0x003C) MISSED OFFSET
};

// ScriptStruct ES2.AttributeAccess
// 0x0050
struct FAttributeAccess
{
	struct FName                                       AttributeID;                                              // 0x0000(0x0008) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	struct FBuffableFloat                              AttributeValueSimple;                                     // 0x0008(0x0040) (Edit)
	class UItemAttribute*                              AttributeValueFromItem;                                   // 0x0048(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ES2.SteeringNoiseParametersStruct
// 0x0008
struct FSteeringNoiseParametersStruct
{
	float                                              SteeringNoiseWavelength;                                  // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SteeringNoiseAmplitudeMeter;                              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ES2.ConsumableInfo
// 0x0018
struct FConsumableInfo
{
	class UItem*                                       ConsumableItem;                                           // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UClass*                                      ConsumableClass;                                          // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AConsumableBase*                             DefaultConsumableObject;                                  // 0x0010(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ES2.ConsumableCooldown
// 0x0010
struct FConsumableCooldown
{
	struct FName                                       ItemTemplateID;                                           // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              RemainingCooldown;                                        // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              InitialCooldown;                                          // 0x000C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ES2.KeybindingConfig
// 0x00B8
struct FKeybindingConfig
{
	TEnumAsByte<EInputActionName>                      Action;                                                   // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FName                                       ActionName;                                               // 0x0004(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       AxisName;                                                 // 0x000C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Category;                                                 // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsAxis;                                                  // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
	struct FKey                                        Key1;                                                     // 0x0020(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FKey                                        Key1Mod;                                                  // 0x0038(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FKey                                        Key2;                                                     // 0x0050(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FKey                                        Key2Mod;                                                  // 0x0068(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	float                                              Scale;                                                    // 0x0080(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DeadZone;                                                 // 0x0084(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              Sensitivity;                                              // 0x0088(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              Exponent;                                                 // 0x008C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bInvert;                                                  // 0x0090(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0091(0x0007) MISSED OFFSET
	struct FText                                       DisplayName;                                              // 0x0098(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FName                                       GroupName;                                                // 0x00B0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ES2.DamagePartEffectText
// 0x0030
struct FDamagePartEffectText
{
	struct FText                                       EffectName;                                               // 0x0000(0x0028) (Edit, BlueprintVisible)
	struct FText                                       EffectValue;                                              // 0x0018(0x0028) (Edit, BlueprintVisible)
};

// ScriptStruct ES2.DeviceInfo
// 0x0018
struct FDeviceInfo
{
	class UItem*                                       DeviceItem;                                               // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DeviceClass;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class ADeviceBase*                                 SpawnedDevice;                                            // 0x0010(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct ES2.DockableStationTemplate
// 0x0070
struct FDockableStationTemplate
{
	struct FName                                       ID;                                                       // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FText                                       Name;                                                     // 0x0008(0x0028) (BlueprintVisible, BlueprintReadOnly)
	TEnumAsByte<EFactions>                             Faction;                                                  // 0x0020(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0021(0x0003) MISSED OFFSET
	struct FName                                       SystemID;                                                 // 0x0024(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       LocationID;                                               // 0x002C(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               CanRepair;                                                // 0x0034(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               CanRestock;                                               // 0x0035(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0036(0x0002) MISSED OFFSET
	float                                              Busyness;                                                 // 0x0038(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                MaxShipsForSale;                                          // 0x003C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              ItemAvailibility;                                         // 0x0040(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              JobsAvailibility;                                         // 0x0044(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               SellsAll;                                                 // 0x0048(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
	TArray<struct FName>                               SellIDs;                                                  // 0x0050(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FName>                               MinPriceItemIDs;                                          // 0x0060(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct ES2.ShipModuleState
// 0x000C
struct FShipModuleState
{
	struct FName                                       ID;                                                       // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EShipModule>                           Type;                                                     // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
};

// ScriptStruct ES2.ShipColors
// 0x00C8
struct FShipColors
{
	struct FLinearColor                                HullColor1;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HullColor1Roughness;                                      // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bHullColor1Metal;                                         // 0x0014(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	struct FLinearColor                                HullColor2;                                               // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HullColor2Roughness;                                      // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bHullColor2Metal;                                         // 0x002C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	struct FLinearColor                                HullColor3;                                               // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HullColor3Roughness;                                      // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bHullColor3Metal;                                         // 0x0044(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0045(0x0003) MISSED OFFSET
	struct FLinearColor                                EmissiveColor1;                                           // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                EmissiveColor2;                                           // 0x0058(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                DecalColorType1;                                          // 0x0068(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                DecalColorType2;                                          // 0x0078(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                DecalColorTypeBorder;                                     // 0x0088(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                DecalColorInsignia1;                                      // 0x0098(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                DecalColorInsignia2;                                      // 0x00A8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                DecalColorInsigniaBorder;                                 // 0x00B8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct ES2.ShipData
// 0x0128
struct FShipData
{
	struct FText                                       Name;                                                     // 0x0000(0x0028) (BlueprintVisible, BlueprintReadOnly)
	class UInventory*                                  Inventory;                                                // 0x0018(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UItem*                                       ShipItemInstance;                                         // 0x0020(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<struct FShipModuleState>                    ShipModules;                                              // 0x0028(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FShipColors                                 ShipColors;                                               // 0x0038(0x00C8) (BlueprintVisible, BlueprintReadOnly)
	TArray<struct FName>                               ShipPerks;                                                // 0x0100(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FName                                       DecalsID;                                                 // 0x0110(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              HealthRatio;                                              // 0x0118(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                SelectedPrimaryIndex;                                     // 0x011C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                SelectedSecondaryIndex;                                   // 0x0120(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                SelectedConsumableIndex;                                  // 0x0124(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ES2.MissionReward
// 0x001C
struct FMissionReward
{
	struct FName                                       ItemID;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       CategoryID;                                               // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EItemRarity>                           ItemRarity;                                               // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	int                                                Amount;                                                   // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ItemLevel;                                                // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ES2.TaskSaveGameData
// 0x00C0
struct FTaskSaveGameData
{
	class UClass*                                      TaskClass;                                                // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       TaskID;                                                   // 0x0008(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EMissionTaskState>                     TaskState;                                                // 0x0010(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EMissionTaskDisplayType>               TaskDisplayType;                                          // 0x0011(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0012(0x0002) MISSED OFFSET
	int                                                Stage;                                                    // 0x0014(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Progress;                                                 // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                SpawnedDuringMissionStage;                                // 0x001C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                DifficultyLevel;                                          // 0x0020(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EMissionTaskTimeLimit>                 TimeLimitType;                                            // 0x0024(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0025(0x0003) MISSED OFFSET
	float                                              TimeLimit;                                                // 0x0028(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              TimeRemaining;                                            // 0x002C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsMission;                                               // 0x0030(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0031(0x0003) MISSED OFFSET
	struct FName                                       LocationID;                                               // 0x0034(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       StationID;                                                // 0x003C(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
	TArray<struct FName>                               ChildTaskIDs;                                             // 0x0048(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TMap<struct FName, struct FESVariant>              Attributes;                                               // 0x0058(0x0050) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FMissionReward>                      Rewards;                                                  // 0x00A8(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	bool                                               bHideInMissionLog;                                        // 0x00B8(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsHidden;                                                // 0x00B9(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EFactions>                             MissionFaction;                                           // 0x00BA(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EFactions>                             EnemyFaction;                                             // 0x00BB(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x00BC(0x0004) MISSED OFFSET
};

// ScriptStruct ES2.SpawnParameter
// 0x0028
struct FSpawnParameter
{
	int                                                LocationLevel;                                            // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
